// programming homework by sangmin

/*
"수 알아 맞추기" 게임을 컴퓨터에서 할 수 있도록 프로그램을 작성하여라. 이 게임은 다음과 같이 진행된다.
게임을 하는 사람은 수를 알아 맞추기 위해 수를 추측하여 입력할 수 있다.
만약 입력된 수가 정답인 수와 일치하면 “맞습니다”라는 메시지를 출력하면서 끝낸다.
그렇지 않으면, 추측한 수가 정답인 수보다 큰 지 혹은 작은 지를 알려준 후,
게임하는 사람이 다른 수를 추측하여 입력하게 한다. 이와 같은 과정을 정답인 수를 맞출 때까지 계속한다.
그리고 시도한 횟수를 함께 출력하여라. 단, 양의 정수만 사용한다.
*/

#include <stdio.h>

int main() {
	int ans, num;				// 정답인 변수 ans, 입력 변수 num
	int count = 1;				// 시행횟수 결정하는 변수

	printf("초기값 설정: ");	// 초기값 입력
	scanf_s("%d", &ans);
	printf("==================================\n");

	printf("하나의 수를 입력하세요: ");
	scanf_s("%d", &num);
	while (1) {
		if (num < ans) {		// 초기값 < 입력값인 경우
			printf("더 큰 수를 입력하세요: ");
			scanf_s("%d", &num);
			count++;
		}
		else if (num > ans) {	// 초기값 > 입력값인 경우
			printf("더 작은 수를 입력하세요: ");
			scanf_s("%d", &num);
			count++;
		}
		else                    // 초기값 = 입력값인 경우
			break;
	}
	printf("맞습니다. 시행횟수는 %d번입니다.\n", count);

	return 0;
}
